{
		"info": "This optional .json file specifies which files to include visibly in the messaging 'emoticons' window, and in which order. Without this file all .png and .jpg image files are included in alphabetical order.",
	"infoDetail": "Once you have added a file and taken it live, you need to leave it in the repository (because old messages will still point at the image). However, you can choose to remove the image from the displayFiles array below so that it is not a selectable emoticon in future, or you can change the order it is displayed in by inserting it in a different location on the list below.",
	"infoBeforeCommitting": "Before committing this file you should confirm it is valid JSON. Recommended tool for 'JSON validation' is available here: https://jsonlint.com/",
	"infoOnImages": "Approx size 400-640 pixels wide or high, and approximately square-shaped. Ideally a .png with a transparent background (which will show the correct background colour in the back-panel), however a .jpg can also be used, if there is no other choice. Each file should be compressed to approximately 45KB. Compression tools are at https://compresspng.com/ or https://tinypng.com/. You should not include more than around 35 images in one folder. Animated .gif files are supported, but also ideally with a transparent background.",
	"infoOnFolders": "You should include the word 'folder' in lower case in the image filename, with the folder's name after it. E.g. 'anythinghere-folder-alien.png' would click through to the folder called 'alien' i.e. 'icons/alien' and show the images there.",
	"infoServerUpdate": "You can include a file called 'anythinghere-update-emoticons.png' if your server is on 'staging', which will update the icons with the latest emoticons sets from the root git project. This icon will not display on production servers.",
	"displayFiles": [
		"agood-folder-basic.png",
		"alien-41605_640.png",
		"alien-41607_640.png",
		"alien-41614_640.png",
		"alien-41617_640.png",
		"alien-41619_640.png",
		"alien-41620_640.png",
		"alien-41623_640.png",
		"alien-41626_640.png",
		"heart.gif",
		"check-update-emoticons.png"	
	]
}